import React, { Fragment } from "react";
import { Typography } from "@mui/material";

const snippetFirst = (
  <Fragment>
    <Typography variant="h6" paragraph>
      Уважаемые государственные органы Кыргызстана! Мы, граждане Кыргызстана,
      обращаемся к вам с просьбой о повышении финансирования образования в нашей
      стране. Образование - это...
    </Typography>
  </Fragment>
);

const snippetSecond = (
  <Fragment>
    <Typography variant="h6" paragraph>
      Уважаемый Министр экологии и природных ресурсов Кыргызстана, Мы, граждане
      Кыргызстана, обращаем ваше внимание на нарастающие проблемы в области
      экологии и загрязнения окружающей среды...
    </Typography>
  </Fragment>
);

const snippetThird = (
  <Fragment>
    <Typography variant="h6" paragraph>
      Уважаемый Министр здравоохранения Кыргызстана,...
    </Typography>
  </Fragment>
);

const snippetFour = (
  <Fragment>
    <Typography variant="h6" paragraph>
      Петиция для Министра по делам женщин и семьи Кыргызстана....
    </Typography>
  </Fragment>
);

const snippetSix = (
  <Fragment>
    <Typography variant="h6" paragraph>
      Уважаемые граждане Кыргызстана и ответственные органы, ...
    </Typography>
  </Fragment>
);

const contentFirst = (
  <Fragment>
    <Typography variant="h6" paragraph>
      Уважаемые государственные органы Кыргызстана! Мы, граждане Кыргызстана,
      обращаемся к вам с просьбой о повышении финансирования образования в нашей
      стране. Образование - это краеугольный камень развития нации, и мы
      считаем, что учительская профессия должна быть признана и поддержана
      соответствующим образом. В настоящее время структура финансирования
      образования требует серьезных улучшений.
    </Typography>

    <Typography variant="h6" paragraph>
      Подтема 1: Увеличение заработной платы учителей
    </Typography>
    <Typography paragraph>
      Несмотря на то, что учителя играют важную роль в будущем нашей страны,
      многие из них сталкиваются с низкой заработной платой, что может
      отразиться на качестве образования. Повышение заработной платы учителей
      имеет следующие преимущества:
    </Typography>

    <Typography paragraph>
      1. Поддержание высокой мотивации учителей и привлечение
      высококвалифицированных специалистов в профессию.
    </Typography>
    <Typography paragraph>
      2. Улучшение качества образования и развитие научно-исследовательской
      работы.
    </Typography>
    <Typography paragraph>
      3. Снижение уровня коррупции в системе образования.
    </Typography>

    <Typography variant="h6" paragraph>
      Подтема 2: Современные образовательные технологии и инфраструктура
    </Typography>
    <Typography paragraph>
      Современные образовательные учреждения должны обеспечивать доступ к
      передовым технологиям и современной инфраструктуре. Это включает в себя:
    </Typography>
    <Typography paragraph>
      1. Обновление учебных программ и внедрение современных образовательных
      методик.
    </Typography>
    <Typography paragraph>
      2. Поддержку и развитие дистанционного обучения и онлайн-ресурсов.
    </Typography>
    <Typography paragraph>
      3. Модернизацию учебных заведений, включая лаборатории и библиотеки.
    </Typography>
  </Fragment>
);

const contentSecond = (
  <Fragment>
    <Typography variant="h6" paragraph>
      Мы, граждане Кыргызстана, обращаем ваше внимание на нарастающие проблемы в
      области экологии и загрязнения окружающей среды в нашей стране. В
      последние десятилетия наблюдается ухудшение состояния природы, что
      негативно сказывается на здоровье граждан и качестве жизни.
    </Typography>

    <Typography variant="h6" paragraph>
      Мы призываем вас принять следующие меры для защиты окружающей среды в
      Кыргызстане:
    </Typography>
    <Typography paragraph>
      Ужесточение нормативов и контроль над выбросами вредных веществ в
      атмосферу от промышленных предприятий.
    </Typography>

    <Typography paragraph>
      Поддержка проектов по утилизации отходов и переработке мусора с целью
      снижения загрязнения почвы и водоемов.
    </Typography>
    <Typography paragraph>
      Проведение образовательных кампаний и мероприятий, направленных на
      повышение осознанности граждан в вопросах экологии и устойчивого
      потребления.
    </Typography>
    <Typography paragraph>
      Содействие развитию альтернативных источников энергии, таких как солнечная
      и ветровая энергия, для снижения зависимости от ископаемых топлив.
    </Typography>
  </Fragment>
);

const contentThird = (
  <Fragment>
    <Typography variant="h6" paragraph>
      Мы, граждане Кыргызстана, обращаем ваше внимание на важную проблему, с
      которой мы сталкиваемся в области здравоохранения. Наши семьи и близкие
      нуждаются в доступной и качественной медицинской помощи, и мы призываем
      вас принять меры для улучшения ситуации.
    </Typography>

    <Typography variant="h6" paragraph>
      Мы предлагаем следующие шаги для улучшения медицинской системы в
      Кыргызстане:
    </Typography>
    <Typography paragraph>
      Увеличить финансирование здравоохранения, чтобы обеспечить современное
      оборудование и качественные медицинские услуги.
    </Typography>

    <Typography paragraph>
      Обеспечить доступность медицинской помощи в отдаленных регионах и селах,
      где медицинские услуги часто ограничены.
    </Typography>
    <Typography paragraph>
      Повысить заработную плату и мотивацию медицинского персонала, чтобы
      привлечь и удержать квалифицированных врачей и медсестер.
    </Typography>
    <Typography paragraph>
      Расширить программы медицинской страховки и социальной поддержки, чтобы
      обеспечить доступность медицинской помощи для всех слоев населения.
    </Typography>
  </Fragment>
);

const contentFour = (
  <Fragment>
    <Typography variant="h6" paragraph>
      Мы, граждане Кыргызстана, обратились к вам с глубокой озабоченностью по
      поводу проблемы насилия в отношении женщин в нашей стране. Насилие в семье
      и гендерное насилие - это серьезная угроза для жизни и достоинства женщин,
      и мы призываем вас принять меры для его предотвращения и борьбы с ним.
    </Typography>

    <Typography variant="h6" paragraph>
      Мы предлагаем следующие шаги для улучшения ситуации в области прав женщин
      и предотвращения насилия:
    </Typography>
    <Typography paragraph>
      Ужесточить законы и наказания за насилие в отношении женщин, включая
      домашнее насилие и домогательства.
    </Typography>

    <Typography paragraph>
      Создать приюты и центры поддержки для женщин, столкнувшихся с насилием, и
      обеспечить им безопасность и психологическую помощь.
    </Typography>
    <Typography paragraph>
      Организовать образовательные кампании о гендерном равенстве и борьбе с
      насилием в сотрудничестве с образовательными учреждениями и гражданским
      обществом.
    </Typography>
    <Typography paragraph>
      ССодействовать экономической независимости женщин и их участию в
      общественной и политической жизни.
    </Typography>
  </Fragment>
);
const contentSix = (
  <Fragment>
    <Typography variant="h6" paragraph>
      Уважаемые граждане Кыргызстана и ответственные органы, Я, как обычный
      гражданин Кыргызстана, хочу привлечь ваше внимание к серьезной проблеме, с
      которой мы сталкиваемся в нашей стране - преступностью и общественной
      безопасностью. Неотъемлемой частью нашей жизни должно быть ощущение
      безопасности, и мы считаем, что совместными усилиями мы можем сделать
      Кыргызстан более безопасным местом для всех.
    </Typography>

    <Typography variant="h6" paragraph>
      Мы призываем вас принять следующие меры для защиты окружающей среды в
      Кыргызстане:
    </Typography>
    <Typography paragraph>
      Ужесточить наказание для преступников, особенно тех, которые совершают
      насилие и грабежи.
    </Typography>

    <Typography paragraph>
      Улучшить оборудование и обучение полицейских, чтобы они могли более
      эффективно бороться с преступностью.
    </Typography>
    <Typography paragraph>
      Повысить осведомленность граждан о мерах безопасности и способах
      предотвращения преступлений.
    </Typography>
    <Typography paragraph>
      Содействовать созданию сети наблюдения и безопасности, чтобы соседи и
      сообщество могли работать вместе для предотвращения преступлений.
    </Typography>
  </Fragment>
);

const posts = [
  {
    title: "Повышение финансирования образования в Кыргызстане",
    id: 1,
    date: 1576281500,
    src: `${process.env.PUBLIC_URL}/images/logged_out/blogPost2.jpg`,
    snippet: snippetFirst,
    content: contentFirst,
  },
  {
    title: "Защита окружающей среды и борьба с загрязнением",
    id: 2,
    date: 1576391600,
    src: `${process.env.PUBLIC_URL}/images/logged_out/blogPost1.jpg`,
    snippet: snippetSecond,
    content: contentSecond,
  },
  {
    title: "Повышение доступности и качества медицинской помощи",
    id: 3,
    date: 1577391600,
    src: `${process.env.PUBLIC_URL}/images/logged_out/blogPost3.jpg`,
    snippet: snippetThird,
    content: contentThird,
  },
  {
    title: "Защита прав женщин и борьба с насилием в отношении женщин",
    id: 4,
    date: 1572281600,
    src: `${process.env.PUBLIC_URL}/images/logged_out/blogPost4.jpg`,
    snippet: snippetFour,
    content: contentFour,
  },
  {
    title: "Улучшение общественной безопасности и борьба с преступностью",
    id: 5,
    date: 1575281600,
    src: `${process.env.PUBLIC_URL}/images/logged_out/blogPost6.jpg`,
    snippet: snippetSix,
    content: contentSix,
  },
];

export default posts;
